Revit 2024 API
Selection.PickBox Method
Overload List
Name | Description
PickBox(PickBoxStyle)
 Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen.
PickBox(PickBoxStyle, String)
 Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen.
See Also
Selection Class
Selection Members
Autodesk.Revit.UI.Selection Namespace